In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("heights.csv")
df.head()

    name  height
0  mohan     5.9
1  maria     5.2
2  sakib     5.1
3    tao     5.5
4  virat     4.9

In [13]:
df['height'].quantile(0.5)

5.55

quantile(0.5) says that at which threshold from 0 , 50% values lies. Here the answer is 5.55, which means 50% of the values of height have value less than or equal to 5.55.

Now, let's check if it is true

In [14]:
len(df['height'])

14

In [15]:
len(df[df['height']<=5.55])

7

Now to get outlier, let's just find threshold value, below which 95% dataset values lies

In [19]:
max_threshold = df['height'].quantile(0.95)

In [20]:
max_threshold

9.689999999999998

In [21]:
# Outlier is 
df[df['height'] > max_threshold]

    name  height
9  imran    14.5

Now to get outlier from below , let's just find the threshold value, above which 95% dataset values lies

In [22]:
min_threshold = df['height'].quantile(0.05)

In [23]:
min_threshold

3.6050000000000004

In [24]:
# Outlier is 
df[df['height'] < min_threshold]

      name  height
12  yoseph     1.2

outlier most of the time is data error or exceptional value which make it model hard for model to generalize properly. So it must be removed.

in real world problems there are a lot of time, when you will not not have the domain knowledge to select the threshold on your own for outliers. Thus percentile (i.e. quantile ) could be much useful technique which help you remove values from both ends.

In [27]:
# filtering from outliers
new_df = df[(df['height']<max_threshold) & (df['height']>min_threshold)]
new_df

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
10     jose     6.1
11  deepika     5.6
13    binod     5.5

In [28]:
# now working on complex dataset

In [29]:
data = pd.read_csv('bhp.csv')

In [30]:
data.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250

In [31]:
data.shape

(13200, 7)

In [33]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13200.000000  13200.000000  13200.000000    1.320000e+04
mean    1555.302783      2.691136    112.276178      2.800833    7.920337e+03
std     1237.323445      1.338915    149.175995      1.292843    1.067272e+05
min        1.000000      1.000000      8.000000      1.000000    2.670000e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.267000e+03
50%     1275.000000      2.000000     71.850000      3.000000    5.438000e+03
75%     1672.000000      3.000000    120.000000      3.000000    7.317000e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [38]:
min_threshold,max_threshold = data.price_per_sqft.quantile([0.001,0.999])

In [39]:
min_threshold,max_threshold

(1366.184, 50959.36200000098)

In [40]:
data[data.price_per_sqft<= min_threshold]

        location       size  total_sqft  bath  price  bhk  price_per_sqft
665    Yelahanka      3 BHK     35000.0   3.0  130.0    3             371
798        other  4 Bedroom     10961.0   4.0   80.0    4             729
1867       other  3 Bedroom     52272.0   2.0  140.0    3             267
2392       other  4 Bedroom      2000.0   3.0   25.0    4            1250
3934       other      1 BHK      1500.0   1.0   19.5    1            1300
5343       other      9 BHK     42000.0   8.0  175.0    9             416
5417      Ulsoor      4 BHK     36000.0   4.0  450.0    4            1250
5597    JP Nagar      2 BHK      1100.0   1.0   15.0    2            1363
7166   Yelahanka  1 Bedroom     26136.0   1.0  150.0    1             573
7862    JP Nagar      3 BHK     20000.0   3.0  175.0    3             875
8300     Kengeri      1 BHK      1200.0   1.0   14.0    1            1166
9144       other  4 Bedroom     10961.0   4.0   80.0    4             729
11635      Begur      3 BHK      2400.0   3.0   12.0    3             500
12355      other      4 BHK     16335.0   4.0  149.0    4             912

In [41]:
data[data.price_per_sqft >=  max_threshold]

,location,size,total_sqft,bath,price,bhk,price_per_sqft
345,other,3 Bedroom,11.0,3.0,74.0,3,672727
1005,other,1 BHK,15.0,1.0,30.0,1,200000
1106,other,5 Bedroom,24.0,2.0,150.0,5,625000
4044,Sarjapur Road,4 Bedroom,1.0,4.0,120.0,4,12000000
4924,other,7 BHK,5.0,7.0,115.0,7,2300000
5911,Mysore Road,1 Bedroom,45.0,1.0,23.0,1,51111
6356,Bommenahalli,4 Bedroom,2940.0,3.0,2250.0,4,76530
7012,other,1 BHK,650.0,1.0,500.0,1,76923
7575,other,1 BHK,425.0,1.0,750.0,1,176470
7799,other,4 BHK,2000.0,3.0,1063.0,4,53150
8307,Bannerghatta Road,5 BHK,2500.0,4.0,1400.0,5,56000
9436,Indira Nagar,4 Bedroom,2400.0,5.0,1250.0,4,52083
11447,Whitefield,4 Bedroom,60.0,4.0,218.0,4,363333
12328,other,4 Bedroom,4350.0,8.0,2600.0,4,59770

In [50]:
data1 = data[(data.price_per_sqft>= min_threshold) & (data.price_per_sqft<= max_threshold)]

In [51]:
data1.shape

(13172, 7)

In [52]:
data1.reset_index(inplace = True,drop = True)

In [54]:
data1.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250

In [55]:
data1.sample(10)

,location,size,total_sqft,bath,price,bhk,price_per_sqft
12176,2nd Phase Judicial Layout,3 BHK,1350.0,2.0,47.25,3,3500
2426,Yelahanka,2 BHK,1300.0,2.0,65.00,2,5000
9570,Kodigehalli,2 Bedroom,500.0,1.0,55.00,2,11000
2910,Sarakki Nagar,3 BHK,2500.0,4.0,325.00,3,13000
9975,Uttarahalli,2 BHK,1200.0,2.0,55.00,2,4583
10224,Kumaraswami Layout,3 BHK,1310.0,2.0,70.00,3,5343
2676,Kengeri Satellite Town,2 BHK,1043.0,2.0,65.00,2,6232
7495,Chikkalasandra,3 BHK,1230.0,2.0,53.51,3,4350
10514,Kammasandra,2 BHK,1415.0,2.0,60.00,2,4240
2017,Haralur Road,2 BHK,1140.0,2.0,43.00,2,3771

# Exercise

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('AB_NYC_2019.csv')

In [5]:
df.shape

(48895, 16)

In [6]:
df.describe()

,id,host_id,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
count,4.889500e+04,4.889500e+04,48895.000000,48895.000000,48895.000000,48895.000000,48895.000000,38843.000000,48895.000000,48895.000000
mean,1.901714e+07,6.762001e+07,40.728949,-73.952170,152.720687,7.029962,23.274466,1.373221,7.143982,112.781327
std,1.098311e+07,7.861097e+07,0.054530,0.046157,240.154170,20.510550,44.550582,1.680442,32.952519,131.622289
min,2.539000e+03,2.438000e+03,40.499790,-74.244420,0.000000,1.000000,0.000000,0.010000,1.000000,0.000000
25%,9.471945e+06,7.822033e+06,40.690100,-73.983070,69.000000,1.000000,1.000000,0.190000,1.000000,0.000000
50%,1.967728e+07,3.079382e+07,40.723070,-73.955680,106.000000,3.000000,5.000000,0.720000,1.000000,45.000000
75%,2.915218e+07,1.074344e+08,40.763115,-73.936275,175.000000,5.000000,24.000000,2.020000,2.000000,227.000000
max,3.648724e+07,2.743213e+08,40.913060,-73.712990,10000.000000,1250.000000,629.000000,58.500000,327.000000,365.000000

In [7]:
min_threshold,max_threshold = df['price'].quantile([0.05,0.95])
min_threshold,max_threshold

(40.0, 355.0)

In [8]:
columns = ['price','minimum_nights','number_of_reviews','reviews_per_month','calculated_host_listings_count']
min_thresholds = []
max_thresholds = []
for x in columns:
    min_threshold,max_threshold = df[x].quantile([0.05,0.95])
    print('min_threshold for ', x ,' = ', min_threshold)
    print('max_threshold for ', x ,' = ', max_threshold)
    print('')
    min_thresholds.append(min_threshold)
    max_thresholds.append(max_threshold)

min_threshold for  price  =  40.0
max_threshold for  price  =  355.0

min_threshold for  minimum_nights  =  1.0
max_threshold for  minimum_nights  =  30.0

min_threshold for  number_of_reviews  =  0.0
max_threshold for  number_of_reviews  =  114.0

min_threshold for  reviews_per_month  =  0.04
max_threshold for  reviews_per_month  =  4.64

min_threshold for  calculated_host_listings_count  =  1.0
max_threshold for  calculated_host_listings_count  =  15.0

In [23]:
data = df.copy()

In [24]:
data.shape

(48895, 16)

In [25]:
# now removing all the outliers of the above columns from data
for x,y,z in zip(columns[:4],min_thresholds[:4],max_thresholds[:4]):
    data = data[(data[x] > y) & (data[x] < z)]
    print(len(data[(data[x] > y) & (data[x] < z)]))

43631
28493
22376
20600

In [26]:
data.shape

(20600, 16)

In [29]:
len(data[data[columns[4]]<max_thresholds[4]])

20325

In [30]:
data = data[data[columns[4]]<max_thresholds[4]]

In [31]:
data.shape

(20325, 16)

In [32]:
data.describe()

,id,host_id,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
count,2.032500e+04,2.032500e+04,20325.00000,20325.000000,20325.000000,20325.000000,20325.000000,20325.000000,20325.000000,20325.000000
mean,1.835489e+07,5.637861e+07,40.72693,-73.952832,130.506421,4.046199,20.735597,1.054546,1.562608,94.892645
std,1.040067e+07,7.024970e+07,0.05455,0.042583,70.058460,3.794552,24.837941,1.066454,1.389037,120.547882
min,5.022000e+03,2.571000e+03,40.50868,-74.244420,41.000000,2.000000,1.000000,0.050000,1.000000,0.000000
25%,9.478196e+06,5.879951e+06,40.68794,-73.981470,75.000000,2.000000,4.000000,0.220000,1.000000,0.000000
50%,1.947500e+07,2.359972e+07,40.71930,-73.954720,115.000000,3.000000,10.000000,0.650000,1.000000,28.000000
75%,2.718551e+07,8.166294e+07,40.76211,-73.937640,170.000000,4.000000,28.000000,1.590000,2.000000,176.000000
max,3.641141e+07,2.733615e+08,40.90391,-73.712990,352.000000,29.000000,113.000000,4.630000,14.000000,365.000000

Now you can see that there no outlier existing in the data. Although we got rid of 28000 datarows but remaining 20000 values are cleaned values.

The less columns you use for outliers preprocessing, the more data you have in the end.